spec/support/vcr_cassettes/claims_api/mpi/find_candidate/valid_icn_full.yml

---
http_interactions:
- request:
    method: post
    uri: "<MPI_URL>"
    body:
      encoding: ASCII-8BIT
      base64_string:
        CjxlbnY6RW52ZWxvcGUgeG1sbnM6c29hcGVuYz0iaHR0cDovL3NjaGVtYXMu
        eG1sc29hcC5vcmcvc29hcC9lbmNvZGluZy8iIHhtbG5zOnhzZD0iaHR0cDov
        L3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEiIHhtbG5zOmVudj0iaHR0cDov
        L3NjaGVtYXMueG1sc29hcC5vcmcvc29hcC9lbnZlbG9wZS8iIHhtbG5zOnhz
        aT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxTY2hlbWEtaW5zdGFuY2Ui
        PgogIDxlbnY6SGVhZGVyLz4KICA8ZW52OkJvZHk+CiAgICA8aWRtOlBSUEFf
        SU4yMDEzMDVVVjAyIHhtbG5zOmlkbT0iaHR0cDovL3Zhd3cub2VkLm9pdC52
        YS5nb3YiIHhtbG5zOnhzaT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS9YTUxT
        Y2hlbWHigJBpbnN0YW5jZSIgeHNpOnNjaGVtYUxvY2F0aW9uPSJ1cm46aGw3
        4oCQb3JnOnYzIC4uLy4uL3NjaGVtYS9ITDdWMy9ORTIwMDgvbXVsdGljYWNo
        ZXNjaGVtYXMvUFJQQV9JTjIwMTMwNVVWMDIueHNkIiB4bWxucz0idXJuOmhs
        N+KAkG9yZzp2MyIgSVRTVmVyc2lvbj0iWE1MXzEuMCI+CiAgICAgIDxpZCBy
        b290PSIxLjIuODQwLjExNDM1MC4xLjEzLjAuMS43LjEuMSIgZXh0ZW5zaW9u
        PSIyMDBWR09WLTI4MzE1Zjg1LWJjNDUtNDA2OS05Y2I0LTRhZDkyODBkZGZh
        YyIvPgogICAgICA8Y3JlYXRpb25UaW1lIHZhbHVlPSIyMDE4MDIyMTIwMTkw
        MSIvPgogICAgICA8dmVyc2lvbkNvZGUgY29kZT0iNC4xIi8+CiAgICAgIDxp
        bnRlcmFjdGlvbklkIHJvb3Q9IjIuMTYuODQwLjEuMTEzODgzLjEuNiIgZXh0
        ZW5zaW9uPSJQUlBBX0lOMjAxMzA1VVYwMiIvPgogICAgICA8cHJvY2Vzc2lu
        Z0NvZGUgY29kZT0iVCIvPgogICAgICA8cHJvY2Vzc2luZ01vZGVDb2RlIGNv
        ZGU9IlQiLz4KICAgICAgPGFjY2VwdEFja0NvZGUgY29kZT0iQUwiLz4KICAg
        ICAgPHJlY2VpdmVyIHR5cGVDb2RlPSJSQ1YiPgogICAgICAgIDxkZXZpY2Ug
        Y2xhc3NDb2RlPSJERVYiIGRldGVybWluZXJDb2RlPSJJTlNUQU5DRSI+CiAg
        ICAgICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy45OTkuMjM0
        IiBleHRlbnNpb249IjIwME0iLz4KICAgICAgICA8L2RldmljZT4KICAgICAg
        PC9yZWNlaXZlcj4KICAgICAgPHNlbmRlciB0eXBlQ29kZT0iU05EIj4KICAg
        ICAgICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0i
        SU5TVEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjIuMTYuODQwLjEuMTEz
        ODgzLjQuMzQ5IiBleHRlbnNpb249IjIwMFZHT1YiLz4KICAgICAgICA8L2Rl
        dmljZT4KICAgICAgPC9zZW5kZXI+CiAgICAgIDxjb250cm9sQWN0UHJvY2Vz
        cyBjbGFzc0NvZGU9IkNBQ1QiIG1vb2RDb2RlPSJFVk4iPgogICAgICAgIDxj
        b2RlIGNvZGU9IlBSUEFfVEUyMDEzMDVVVjAyIiBjb2RlU3lzdGVtPSIyLjE2
        Ljg0MC4xLjExMzg4My4xLjYiLz4KICAgICAgICA8cXVlcnlCeVBhcmFtZXRl
        cj4KICAgICAgICAgIDxxdWVyeUlkIHJvb3Q9IjEuMi44NDAuMTE0MzUwLjEu
        MTMuMjguMS4xOC41Ljk5OSIgZXh0ZW5zaW9uPSIxODIwNCIvPgogICAgICAg
        ICAgPHN0YXR1c0NvZGUgY29kZT0ibmV3Ii8+CiAgICAgICAgICA8bW9kaWZ5
        Q29kZSBjb2RlPSJNVkkuQ09NUDIiLz4KICAgICAgICAgIDxpbml0aWFsUXVh
        bnRpdHkgdmFsdWU9IjEiLz4KICAgICAgICAgIDxwYXJhbWV0ZXJMaXN0Pgog
        ICAgICAgICAgICA8aWQgcm9vdD0iMi4xNi44NDAuMS4xMTM4ODMuNC4zNDki
        IGV4dGVuc2lvbj0iMTAwODcxNDcwMVY0MTYxMTFeTkleMjAwTV5VU1ZIQV5Q
        Ii8+CiAgICAgICAgICA8L3BhcmFtZXRlckxpc3Q+CiAgICAgICAgPC9xdWVy
        eUJ5UGFyYW1ldGVyPgogICAgICA8L2NvbnRyb2xBY3RQcm9jZXNzPgogICAg
        PC9pZG06UFJQQV9JTjIwMTMwNVVWMDI+CiAgPC9lbnY6Qm9keT4KPC9lbnY6
        RW52ZWxvcGU+Cgo8ZW52OkVudmVsb3BlIHhtbG5zOnNvYXBlbmM9Imh0dHA6
        Ly9zY2hlbWFzLnhtbHNvYXAub3JnL3NvYXAvZW5jb2RpbmcvIiB4bWxuczp4
        c2Q9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hIiB4bWxuczpl
        bnY9Imh0dHA6Ly9zY2hlbWFzLnhtbHNvYXAub3JnL3NvYXAvZW52ZWxvcGUv
        IiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1h
        LWluc3RhbmNlIj4KICA8ZW52OkhlYWRlci8+CiAgPGVudjpCb2R5PgogICAg
        PGlkbTpQUlBBX0lOMjAxMzA1VVYwMiB4bWxuczppZG09Imh0dHA6Ly92YXd3
        Lm9lZC5vaXQudmEuZ292IiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3Jn
        LzIwMDEvWE1MU2NoZW1h4oCQaW5zdGFuY2UiIHhzaTpzY2hlbWFMb2NhdGlv
        bj0idXJuOmhsN+KAkG9yZzp2MyAuLi8uLi9zY2hlbWEvSEw3VjMvTkUyMDA4
        L211bHRpY2FjaGVzY2hlbWFzL1BSUEFfSU4yMDEzMDVVVjAyLnhzZCIgeG1s
        bnM9InVybjpobDfigJBvcmc6djMiIElUU1ZlcnNpb249IlhNTF8xLjAiPgog
        ICAgICA8aWQgcm9vdD0iMS4yLjg0MC4xMTQzNTAuMS4xMy4wLjEuNy4xLjEi
        IGV4dGVuc2lvbj0iMjAwVkdPVi0yODMxNWY4NS1iYzQ1LTQwNjktOWNiNC00
        YWQ5MjgwZGRmYWMiLz4KICAgICAgPGNyZWF0aW9uVGltZSB2YWx1ZT0iMjAx
        ODAyMjEyMDE5MDEiLz4KICAgICAgPHZlcnNpb25Db2RlIGNvZGU9IjQuMSIv
        PgogICAgICA8aW50ZXJhY3Rpb25JZCByb290PSIyLjE2Ljg0MC4xLjExMzg4
        My4xLjYiIGV4dGVuc2lvbj0iUFJQQV9JTjIwMTMwNVVWMDIiLz4KICAgICAg
        PHByb2Nlc3NpbmdDb2RlIGNvZGU9IlQiLz4KICAgICAgPHByb2Nlc3NpbmdN
        b2RlQ29kZSBjb2RlPSJUIi8+CiAgICAgIDxhY2NlcHRBY2tDb2RlIGNvZGU9
        IkFMIi8+CiAgICAgIDxyZWNlaXZlciB0eXBlQ29kZT0iUkNWIj4KICAgICAg
        ICA8ZGV2aWNlIGNsYXNzQ29kZT0iREVWIiBkZXRlcm1pbmVyQ29kZT0iSU5T
        VEFOQ0UiPgogICAgICAgICAgPGlkIHJvb3Q9IjEuMi44NDAuMTE0MzUwLjEu
        MTMuOTk5LjIzNCIgZXh0ZW5zaW9uPSIyMDBNIi8+CiAgICAgICAgPC9kZXZp
        Y2U+CiAgICAgIDwvcmVjZWl2ZXI+CiAgICAgIDxzZW5kZXIgdHlwZUNvZGU9
        IlNORCI+CiAgICAgICAgPGRldmljZSBjbGFzc0NvZGU9IkRFViIgZGV0ZXJt
        aW5lckNvZGU9IklOU1RBTkNFIj4KICAgICAgICAgIDxpZCByb290PSIyLjE2
        Ljg0MC4xLjExMzg4My40LjM0OSIgZXh0ZW5zaW9uPSIyMDBWR09WIi8+CiAg
        ICAgICAgPC9kZXZpY2U+CiAgICAgIDwvc2VuZGVyPgogICAgICA8Y29udHJv
        bEFjdFByb2Nlc3MgY2xhc3NDb2RlPSJDQUNUIiBtb29kQ29kZT0iRVZOIj4K
        ICAgICAgICA8Y29kZSBjb2RlPSJQUlBBX1RFMjAxMzA1VVYwMiIgY29kZVN5
        c3RlbT0iMi4xNi44NDAuMS4xMTM4ODMuMS42Ii8+CiAgICAgICAgPHF1ZXJ5
        QnlQYXJhbWV0ZXI+CiAgICAgICAgICA8cXVlcnlJZCByb290PSIxLjIuODQw
        LjExNDM1MC4xLjEzLjI4LjEuMTguNS45OTkiIGV4dGVuc2lvbj0iMTgyMDQi
        Lz4KICAgICAgICAgIDxzdGF0dXNDb2RlIGNvZGU9Im5ldyIvPgogICAgICAg
        ICAgPG1vZGlmeUNvZGUgY29kZT0iTVZJLkNPTVAxLlJNUyIvPgogICAgICAg
        ICAgPGluaXRpYWxRdWFudGl0eSB2YWx1ZT0iMSIvPgogICAgICAgICAgPHBh
        cmFtZXRlckxpc3Q+CiAgICAgICAgICAgIDxpZCByb290PSIyLjE2Ljg0MC4x
        LjExMzg4My40LjM0OSIgZXh0ZW5zaW9uPSIxMDA4NzE0NzAxVjQxNjExMV5O
        SV4yMDBNXlVTVkhBXlAiLz4KICAgICAgICAgIDwvcGFyYW1ldGVyTGlzdD4K
        ICAgICAgICA8L3F1ZXJ5QnlQYXJhbWV0ZXI+CiAgICAgIDwvY29udHJvbEFj
        dFByb2Nlc3M+CiAgICA8L2lkbTpQUlBBX0lOMjAxMzA1VVYwMj4KICA8L2Vu
        djpCb2R5Pgo8L2VudjpFbnZlbG9wZT4K
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - PRPA_IN201305UV02
      Date:
      - Wed, 21 Feb 2018 20:19:01 GMT
      Content-Length:
      - '1904'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Backside-Transport:
      - OK OK,OK OK
      Connection:
      - Keep-Alive
      Transfer-Encoding:
      - chunked
      Date:
      - Tue, 20 Aug 2019 19:53:14 GMT
      Content-Type:
      - text/xml
      Set-Cookie:
      - JSESSIONID=phiwlzJiY2YThkYpywDUSco1jzXX5L2ytKU0v2l-mUkzVicz2ai1!1741642591;
        path=/; HttpOnly
      X-Global-Transaction-Id:
      - 4bae058f5d5c4fa906c85472
    body:
      encoding: UTF-8
      string:
        <?xml version="1.0" encoding="UTF-8"?>
        <env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
          <env:Header/>
          <env:Body>
            <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"
              xmlns:idm="http://vaww.oed.oit.va.gov"
              xmlns="urn:hl7-org:v3">
              <id extension="WSDOC1908201553145951848240311" root="2.16.840.1.113883.4.349"/>
              <creationTime value="20190820155314"/>
              <versionCode code="4.1"/>
              <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
              <processingCode code="T"/>
              <processingModeCode code="T"/>
              <acceptAckCode code="NE"/>
              <receiver typeCode="RCV">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
                </device>
              </receiver>
              <sender typeCode="SND">
                <device determinerCode="INSTANCE" classCode="DEV">
                  <id extension="200M" root="2.16.840.1.113883.4.349"/>
                </device>
              </sender>
              <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                  <id extension="200VGOV-28315f85-bc45-4069-9cb4-4ad9280ddfac" root="1.2.840.114350.1.13.0.1.7.1.1"/>
                </targetMessage>
              </acknowledgement>
              <controlActProcess classCode="CACT" moodCode="EVN">
                <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
                <subject typeCode="SUBJ">
                  <registrationEvent classCode="REG" moodCode="EVN">
                    <id nullFlavor="NA"/>
                    <statusCode code="active"/>
                    <subject1 typeCode="SBJ">
                      <patient classCode="PAT">
                        <id extension="1008714701V416111^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                        <id extension="796122306^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="9100792239^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/>
                        <id extension="1008714701^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/>
                        <id root="2.16.840.1.113883.4.349" extension="32383600^PI^200CORP^USVBA^L"/>
                        <statusCode code="active"/>
                        <patientPerson>
                          <name use="L">
                            <given>MITCHELL</given>
                            <given>G</given>
                            <family>JENKINS</family>
                          </name>
                          <administrativeGenderCode code="M"/>
                          <birthTime value="19490304"/>
                          <addr use="PHYS">
                            <streetAddressLine>121 A St</streetAddressLine>
                            <city>Austin</city>
                            <state>TX</state>
                            <postalCode>78772</postalCode>
                            <country>USA</country>
                          </addr>
                          <asOtherIDs classCode="SSN">
                            <id extension="796122306" root="2.16.840.1.113883.4.1"/>
                            <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                              <id root="1.2.840.114350.1.13.99997.2.3412"/>
                            </scopingOrganization>
                          </asOtherIDs>
                        </patientPerson>
                        <subjectOf1>
                          <queryMatchObservation classCode="COND" moodCode="EVN">
                            <code code="IHE_PDQ"/>
                            <value nullFlavor="NA" xsi:type="INT"/>
                          </queryMatchObservation>
                        </subjectOf1>
                      </patient>
                    </subject1>
                    <custodian typeCode="CST">
                      <assignedEntity classCode="ASSIGNED">
                        <id root="2.16.840.1.113883.4.349"/>
                      </assignedEntity>
                    </custodian>
                  </registrationEvent>
                </subject>
                <queryAck>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <queryResponseCode code="OK"/>
                  <resultCurrentQuantity value="1"/>
                </queryAck>
                <queryByParameter>
                  <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
                  <statusCode code="new"/>
                  <modifyCode code="MVI.COMP1.RMS"/>
                  <initialQuantity value="1"/>
                  <parameterList>
                    <id extension="1008714701V416111^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                  </parameterList>
                </queryByParameter>
              </controlActProcess>
            </idm:PRPA_IN201306UV02>
          </env:Body>
        </env:Envelope>
    http_version: 
  recorded_at: Wed, 21 Feb 2018 20:19:01 GMT
recorded_with: VCR 3.0.3
